In [24]:
#import libraries
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from bs4 import BeautifulSoup

In [25]:
data = []
folder = r"C:\Users\balin\Desktop\magnimind-assignments\NLP job_posting project\data\job_postings"

for filename in os.listdir(folder):
    if filename.endswith('.html'):
        full_path = os.path.join(folder, filename)
        with open(full_path, 'r', encoding='utf-8') as f:
            soup = BeautifulSoup(f, 'lxml')
            title = soup.title.text if soup.title else 'No Title'
            body = soup.body.get_text(separator='\n', strip=True)
            data.append({'filename': filename, 'title': title, 'body': body})

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)

In [33]:
df.shape

(1458, 3)

In [34]:
df.head()

,body,job_title,location
0,"Data Scientist - Beavercreek, OH\nData Scienti...",Data Scientist,"Beavercreek, OH"
1,"Data Scientist - Seattle, WA 98101\nAre you in...",Data Scientist,"Seattle, WA 98101"
2,"Data Scientist - Newark, CA\nData Scientist\nN...",Data Scientist,"Newark, CA"
3,Patient Care Assistant / PCA - Med/Surg (Fayet...,Patient Care Assistant / PCA,"Med/Surg (Fayette, AL) - Fayette, AL"
4,"Data Manager / Analyst - Oakland, CA\nHOW YOU ...",Data Manager / Analyst,"Oakland, CA"

# Clean the data

In [28]:
# title column contains job title and location, split these into two separate columns
df[['job_title', 'location']] = df['title'].str.split(' - ', n=1, expand=True)

# Drop the original 'title' column
df.drop(columns=['title','filename'], inplace=True)

In [29]:
df.head()

,body,job_title,location
0,"Data Scientist - Beavercreek, OH\nData Scienti...",Data Scientist,"Beavercreek, OH"
1,"Data Scientist - Seattle, WA 98101\nAre you in...",Data Scientist,"Seattle, WA 98101"
2,"Data Scientist - Newark, CA\nData Scientist\nN...",Data Scientist,"Newark, CA"
3,Patient Care Assistant / PCA - Med/Surg (Fayet...,Patient Care Assistant / PCA,"Med/Surg (Fayette, AL) - Fayette, AL"
4,"Data Manager / Analyst - Oakland, CA\nHOW YOU ...",Data Manager / Analyst,"Oakland, CA"

In [32]:
df.describe()

,body,job_title,location
count,1458,1458,1458
unique,1457,1005,772
top,"Physics Data Scientist - Foothill Ranch, CA\nT...",Data Scientist,"San Francisco, CA"
freq,2,182,89